/*
 Navicat Premium Data Transfer

 Source Server         : localhost
 Source Server Type    : MySQL
 Source Server Version : 50726
 Source Host           : localhost:3306
 Source Schema         : testmry

 Target Server Type    : MySQL
 Target Server Version : 50726
 File Encoding         : 65001

 Date: 30/12/2024 16:50:21
*/

SET NAMES utf8mb4;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
-- Table structure for admins
-- ----------------------------
DROP TABLE IF EXISTS `admins`;
CREATE TABLE `admins`  (
  `id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '管理员编号',
  `name` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL COMMENT '管理员名称',
  `username` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL COMMENT '用户名',
  `password` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL COMMENT '密码',
  `head_img` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL COMMENT '头像',
  `create_time` datetime(0) NULL DEFAULT NULL COMMENT '创建时间',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 2 CHARACTER SET = utf8 COLLATE = utf8_general_ci COMMENT = '管理员管理' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of admins
-- ----------------------------
INSERT INTO `admins` VALUES (1, 'admin', 'admin', 'admin', 'http://localhost:8092/file/011fd667-66e1-41db-acf3-2c3a8bbbea88.jpg', '2024-11-13 14:05:45');

-- ----------------------------
-- Table structure for banner
-- ----------------------------
DROP TABLE IF EXISTS `banner`;
CREATE TABLE `banner`  (
  `id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '轮播图编号',
  `banner_img` varchar(200) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL COMMENT '图片地址',
  `status` int(11) NULL DEFAULT NULL COMMENT '状态[0:禁用,1:启用]',
  `create_time` datetime(0) NULL DEFAULT NULL COMMENT '创建时间',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 5 CHARACTER SET = utf8 COLLATE = utf8_general_ci COMMENT = '轮播图' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of banner
-- ----------------------------
INSERT INTO `banner` VALUES (1, 'http://localhost:8092/file/edbf3be3-baf4-4f40-ae5e-b196b288cc54.png', 1, '2024-11-13 14:08:20');
INSERT INTO `banner` VALUES (2, 'http://localhost:8092/file/cbb777a8-b7f0-4cc7-9072-97f2293fe19b.jpg', 1, '2024-11-13 14:09:59');
INSERT INTO `banner` VALUES (3, 'http://localhost:8092/file/1aa75604-96dd-48fb-921c-b8be24d22c43.png', 1, '2024-11-13 14:10:10');
INSERT INTO `banner` VALUES (4, 'http://localhost:8092/file/c46a2ca7-560e-4261-bcf9-190cd6d2da11.png', 1, '2024-12-04 11:01:20');

-- ----------------------------
-- Table structure for beautician
-- ----------------------------
DROP TABLE IF EXISTS `beautician`;
CREATE TABLE `beautician`  (
  `id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '美容师编号',
  `job_id` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL COMMENT '工号',
  `name` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL COMMENT '姓名',
  `username` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL COMMENT '账号',
  `password` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL COMMENT '密码',
  `sex` int(11) NULL DEFAULT NULL COMMENT '性别[0:男,1:女]',
  `age` int(11) NULL DEFAULT NULL COMMENT '年龄',
  `avatar` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL COMMENT '头像',
  `info` text CHARACTER SET utf8 COLLATE utf8_general_ci NULL COMMENT '个人简介',
  `status` int(11) NULL DEFAULT NULL COMMENT '当前状态[0:休息,1:空闲,2:服务中]',
  `create_time` datetime(0) NULL DEFAULT NULL COMMENT '创建时间',
  `recomment` int(11) NULL DEFAULT NULL COMMENT '首页推荐',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 9 CHARACTER SET = utf8 COLLATE = utf8_general_ci COMMENT = '美容师' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of beautician
-- ----------------------------
INSERT INTO `beautician` VALUES (1, '1001', '小红', '1001', '123456', 1, 26, 'http://localhost:8092/file/b7c51600-8718-4cf5-aecc-0fe0fcacc504.jpg', '擅长：抗衰、紧致、除皱，祛斑祛痣去色素，亮肤，补水。', 1, '2024-11-13 16:31:12', 2);
INSERT INTO `beautician` VALUES (2, '1002', '小张', '1002', '123456', 0, 23, 'http://localhost:8092/file/c23bf293-759c-4ff9-a594-379f93c2e684.jpg', '擅长：祛斑、祛痣、去色素，亮肤，补水，黄金微针。', 1, '2024-11-13 16:35:07', NULL);
INSERT INTO `beautician` VALUES (3, '1003', '小美', '1003', '123456', 1, 22, 'http://localhost:8092/file/1035cc81-99d7-4189-b29a-08db525f26ab.jpg', '擅长水光针、光子嫩肤、身体护理，热玛吉，指甲护理。', 1, '2024-12-03 17:40:48', 2);
INSERT INTO `beautician` VALUES (4, '1004', '小李', '1004', '123456', 0, 30, 'http://localhost:8092/file/e7b7344c-27fc-4b7a-b080-cff9483e28b1.jpg', '擅长纹眉、修眉、眉形设计，面部护理，牙齿美白。', 1, '2024-12-03 17:42:08', NULL);
INSERT INTO `beautician` VALUES (5, '1005', '小梁', '1005', '123456', 0, 29, 'http://localhost:8092/file/2c2852dd-82c4-40d6-864d-7e9d98c7bf74.jpg', '擅长：SPA水疗，头发护理，热玛吉，光子嫩肤。', 0, '2024-12-04 11:55:37', 2);
INSERT INTO `beautician` VALUES (6, '1006', '小石', '1006', '123456', 1, 40, 'http://localhost:8092/file/e937258c-93f1-4ffa-bb32-50b34a0af4ed.jpg', '擅长：身体按摩，激光脱毛，身体去角质，唇部护理。', 1, '2024-12-04 12:01:07', NULL);
INSERT INTO `beautician` VALUES (7, '1007', '小陆', '1007', '123456', 1, 22, 'http://localhost:8092/file/428bbf78-41df-4e96-99ca-71e417638171.jpg', '擅长：美白，身体按摩，SPA水疗，激光脱毛。', 1, '2024-12-04 12:02:59', 2);
INSERT INTO `beautician` VALUES (8, '1008', '小华', '1008', '123456', 0, 30, 'http://localhost:8092/file/acd7c868-65ca-44f4-8439-855d5864293e.jpg', '擅长：眉形设计，黄金微光，水光，点阵激光。', 1, '2024-12-04 12:04:55', NULL);

-- ----------------------------
-- Table structure for beauty_projects
-- ----------------------------
DROP TABLE IF EXISTS `beauty_projects`;
CREATE TABLE `beauty_projects`  (
  `id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '项目编号',
  `title` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL COMMENT '标题',
  `info` text CHARACTER SET utf8 COLLATE utf8_general_ci NULL COMMENT '简介',
  `price` decimal(10, 2) NULL DEFAULT NULL COMMENT '价格',
  `detail` text CHARACTER SET utf8 COLLATE utf8_general_ci NULL COMMENT '详情',
  `cover_img` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL COMMENT '封面图片',
  `create_time` datetime(0) NULL DEFAULT NULL COMMENT '创建时间',
  `status` int(11) NULL DEFAULT NULL COMMENT '状态[0:禁用,1:启用]',
  `banner` int(11) NULL DEFAULT NULL COMMENT '首页推荐',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 27 CHARACTER SET = utf8 COLLATE = utf8_general_ci COMMENT = '美容项目' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of beauty_projects
-- ----------------------------
INSERT INTO `beauty_projects` VALUES (1, '光子嫩肤', '光子嫩肤可显著提亮肤色、有效淡化细纹，紧致缩小毛孔、改善肤质。', 859.00, '#### 工作原理\n光子嫩肤利用的是选择性光热作用原理。不同波长的光可以被皮肤中的不同成分吸收。例如，黑色素、血红蛋白和水分子等都可以吸收特定波长的光。当这些成分吸收光能后，会产生热量，从而破坏或改变其结构，达到治疗目的。\n\n#### 适用人群\n- 肤色不均、有色素沉着的人群\n- 有细纹、皱纹等轻度老化迹象的人群\n- 面部有红血丝、毛细血管扩张的人群\n- 希望改善毛孔粗大问题的人群\n- 想要提亮肤色、增加皮肤光泽度的人群\n\n![1aa7560496dd48fb921cb8be24d22c43.png](http://localhost:8092/file/5b8436d2-d4f6-493f-8f09-d2f4d87f9c44.png)\n\n#### 治疗过程\n- 咨询与评估：在治疗前，医生会进行详细的皮肤评估，了解患者的皮肤状况和需求，制定个性化的治疗方案。\n- 清洁与准备：治疗前需要彻底清洁面部，并涂抹专用的冷凝胶，以保护皮肤并提高治疗效果。\n- 治疗操作：医生会根据治疗方案选择合适的波长和能量，将光均匀照射在面部或其他治疗区域。每次治疗大约需要20-30分钟。\n- 术后护理：治疗后，医生会提供一些护肤建议，如避免阳光直射、使用温和护肤品等。部分人可能会出现轻微的红肿或灼热感，通常会在几小时内消退。\n\n#### 注意事项\n- 治疗前后应避免暴晒和使用刺激性护肤品。\n- 治疗后可能会有短暂的红肿或斑点加深现象，这是正常的反应，一般会在几天内恢复。\n- 多次治疗可以增强效果，但每次治疗之间需要间隔一段时间。\n- 光子嫩肤是一种安全有效的美容方法，能够帮助改善多种皮肤问题，提升肌肤质量。如果你对自己的皮肤状况不满意，不妨考虑尝试这种非侵入性的美容技术。\n\n\n\n\n', 'http://localhost:8092/file/af1398ab-c533-4607-bddc-e8a2a9e1cff1.png', '2024-11-13 14:53:20', 1, 2);
INSERT INTO `beauty_projects` VALUES (4, '面部护理', '面部护理焕发肌肤光彩，深层清洁与保湿，恢复肌肤水润与弹性。', 150.00, '#### 工作原理\n通过专业的洁面产品和手法，深层清洁肌肤，去除污垢、油脂和老化角质，为肌肤提供清爽的环境；利用护肤品中的营养成分，如维生素、胶原蛋白等，为肌肤提供所需的营养，促进细胞再生和修复；通过按摩等手法，促进血液循环，加速新陈代谢，有助于排出毒素和废物，改善肤色；平衡肌肤的水油平衡，调节肌肤的酸碱度，使肌肤更加健康、稳定。\n\n#### 适用人群\n面部护理适用于以下人群：\n- 皮肤干燥、缺水：肌肤缺乏水分，导致干燥、紧绷、脱皮等现象。\n- 肤色暗沉、色斑：由于紫外线、内分泌等因素导致的肤色暗沉、色斑等问题。\n- 肌肤敏感、易受刺激：肌肤屏障受损，容易受到外界环境的刺激，出现红肿、瘙痒等问题。\n\n![1aa7560496dd48fb921cb8be24d22c43.png](http://localhost:8092/file/5b8436d2-d4f6-493f-8f09-d2f4d87f9c44.png)\n\n#### 治疗过程\n面部护理的治疗过程通常包括以下几个步骤：\n- 清洁：使用温水和洁面产品彻底清洁面部，去除污垢和油脂。\n- 去角质：使用温和的去角质产品去除老化角质，使肌肤更加光滑细腻。\n- 按摩：使用专业的按摩手法和护肤品，促进血液循环，加速新陈代谢。\n- 敷面膜：根据肌肤状况选择合适的面膜，进行深层滋养和修复。\n保湿：使用保湿乳液或面霜，为肌肤提供持久的保湿效果。\n\n#### 注意事项\n在进行面部护理时，需要注意以下事项：\n- 选择正规机构：确保选择正规的医疗机构或美容机构进行面部护理，避免受到不良产品的侵害。\n- 了解自身肤质：在进行面部护理前，要了解自己的肤质和需求，选择适合自己的护理项目和产品。\n- 避免过度清洁：不要过度清洁面部，以免破坏肌肤屏障，导致肌肤敏感和干燥。\n- 注意饮食健康：保持健康的饮食习惯，多摄入富含维生素和蛋白质的食物，有助于肌肤的健康和修复。\n- 防晒：在进行面部护理后，要注意防晒，避免紫外线对肌肤的伤害。\n- 避免刺激：避免使用含有刺激性成分的护肤品，以免刺激肌肤导致不适。\n', 'http://localhost:8092/file/37b23ca9-e2bc-495b-af1f-0c6db009d398.png', '2024-11-13 07:06:23', 1, NULL);
INSERT INTO `beauty_projects` VALUES (5, '水光', '水光可保湿锁水、美白嫩肤、紧致提升、祛痘杀菌并淡化皱纹。', 500.00, '#### 工作原理\n水光针的原理是通过皮肤微创注射技术，将透明质酸等保湿成分及其他活性物质注射到皮肤真皮层，利用这些成分在皮肤内形成保湿层，锁住水分，同时激活皮肤自我修复机制，促进胶原蛋白和弹力纤维的生成，从而改善皮肤干燥、缺水、肤色不均、细纹等问题，使皮肤变得水润、光泽、有弹性。\n#### 适用人群\n水光针适用于18岁以上到60岁以下的人群，特别是以下情况：\n- 皮肤干燥、缺水，看起来显老的人。\n- 气色不好，为皮肤不化妆就没有朝气而烦恼的人。\n- 平时不容易上妆的干性皮肤人。\n- 极度缺水皮肤，即使用高价格的补水乳液也没办法改善皮肤干燥的人。\n- 肌肤已经老化或希望预防肌肤老化的人。\n- 肌肤受到光损害的人。\n然而，以下人群则不适合水光针：\n- 过敏体质或对水光针成分过敏的人。\n- 面部有明显发炎或皮肤有传染性疾病者。\n- 短时间内做过微整手术，面部还未得到修复的人。\n- 生病或哺乳期的人。\n\n![1aa7560496dd48fb921cb8be24d22c43.png](http://localhost:8092/file/5b8436d2-d4f6-493f-8f09-d2f4d87f9c44.png)\n\n#### 治疗过程\n水光针的治疗过程通常包括以下几个步骤：\n- 清洁面部：使用温和的清洁剂彻底清洁面部，确保皮肤无油脂污垢。\n- 消毒：使用含有酒精或其他消毒成分的溶液对面部进行全面消毒，以避免感染。\n- 涂抹表面麻醉剂：在治疗区域涂抹表面麻醉剂，一般需要等待20~30分钟以减少痛感。\n- 配制注射液：根据个体皮肤状况，配制适量的透明质酸等注射液。\n- 调整注射器：选择合适的水光针注射器，并调节好注射深度和剂量。\n- 注射：通过多点注射技术，将配制好的注射液均匀注入皮肤的真皮层。注射过程一般持续20~30分钟。\n- 冷敷：注射结束后进行冷敷，可以有效减轻红肿和疼痛。\n\n#### 注意事项\n请注意，水光针的效果因个体差异而异，且可能存在一定的风险和副作用。在进行水光针治疗时，务必选择正规的医疗机构，由专业医生进行操作，并严格遵循术前和术后的注意事项，以确保治疗的安全和效果。\n- 术后护理：注射水光针后，施术部位要保持干净，不能过分按摩揉捏，要注意防晒。建议在24小时内避免沾水，避免挤压脸部，避免脸部暴晒，避免剧烈运动，避免接触刺激性物质，避免化妆。72小时之后再进行洗脸、护肤等，避免使用刺激性护肤品，洗脸注意要轻柔。\n- 生活习惯：在饮食上，要注意多吃富含维生素的水果和富含膳食纤维的蔬菜，避免抽烟、饮酒，以及吃辛辣刺激和生冷油腻的食物。保持一个健康的生活习惯。\n- 避开特殊时期：打水光针要避开月经期，以免导致局部出现感染的情况。\n- 保暖：水光针属于一种注射类的护肤疗法，注射后局部的皮肤比较娇嫩，因此应做好相关的防护措施，以免出现着凉的情况。\n\n\n', 'http://localhost:8092/file/9fff5db2-6c7b-47a4-a120-cfa7ec1816b0.jpg', '2024-11-13 07:06:23', 1, 2);
INSERT INTO `beauty_projects` VALUES (7, '点阵激光', '点阵激光可淡化色斑痘痕，紧致肌肤，祛疤除痕，祛斑祛痣，改善毛孔粗大和光老化。', 180.00, '#### 工作原理\n点阵激光是一种基于局灶性光热作用原理的医美方法。它使用特定的波长激光照射皮肤，能够在皮肤组织中产生许多微治疗孔，这一过程不仅有助于分解色素细胞，达到祛斑的效果，还能刺激皮下胶原蛋白和弹性纤维的再生，进而达到紧致皮肤、减少细小皱纹的目的。\n\n#### 适用人群\n点阵激光适用于以下人群：\n- 有青春痘印、黄褐斑、毛孔粗大、痤疮和痘疤痘印等皮肤问题的人。\n- 有眼角皱纹、细纹、脸部及额部皱褶、骨节褶皱及妊娠纹者。\n有雀斑、颧骨母斑等色素性变病者。\n- 有皮肤松弛及深层次疤痕者，希望通过治疗改善肤质和外观。\n请注意，以下人群不适合接受点阵激光治疗：\n- 疤痕体质者。\n- 严重糖尿病、高血压患者。\n- 精神疾病患者，或对治疗效果有过高期待者。\n- 处于活跃期的白癜风、银屑病或针对性红斑狼疮患者。\n- 怀孕期或哺乳期间的女性。\n- 光过敏症状者。\n- 曾行有机化学剥落术、切削术以及其它焕肤术的患者。\n- 应用维甲酸药品者。\n- 不愿意术后进行防晒隔离，及接纳切削术风险的患者。\n\n![1aa7560496dd48fb921cb8be24d22c43.png](http://localhost:8092/file/5b8436d2-d4f6-493f-8f09-d2f4d87f9c44.png)\n\n#### 治疗过程\n点阵激光的治疗过程通常包括以下几个步骤：\n- 医生评估：患者就诊后，医生会根据患者的具体情况进行评估，并制定个性化的治疗计划。\n- 清洁与麻醉：患者需要彻底清洁治疗部位的皮肤，并涂抹麻醉药物，以减轻治疗时的疼痛感。如果疼痛承受能力强，也可以不用打麻醉药。\n- 激光治疗：医生根据治疗计划，通过计算机控制激光器进行点阵激光治疗。激光器会发射出细小的激光束，均匀地打在需要治疗的皮肤上，形成一系列的“点”。这些微治疗孔会促进皮肤组织的修复和再生。\n- 后续处理：治疗结束后，医生会用消毒棉球或纱布轻轻按压治疗部位，以清除多余的血液和液体。治疗部位需要进行适当的保护，通常会涂抹一些保护性的药膏或护肤品。\n\n#### 注意事项\n在接受点阵激光治疗时，患者需要注意以下事项：\n- 治疗前准备：治疗前应避免使用含有化学成分的护肤品，避免对皮肤产生刺激。同时，要保持良好的作息和饮食习惯，以提高皮肤的自我修复能力。\n- 治疗间隔：两次治疗之间必须间隔一段时间，通常建议半个月以上。这是因为点阵激光治疗会对皮肤产生轻微的损伤，需要一定的时间来恢复。\n- 治疗后护理：治疗后，皮肤可能会出现红肿、灼热感等正常现象。此时，可以使用冰袋进行局部冰敷处理，以减轻肿胀与疼痛。同时，要保持治疗部位的清洁和干燥，避免沾水以防止感染。\n- 防晒与保湿：治疗后，皮肤对紫外线的敏感度会增加。因此，在户外活动时，务必做好防晒工作，避免阳光直射。此外，要加强皮肤的保湿工作，使用温和的保湿产品来维护皮肤的水分平衡。\n- 避免刺激：治疗后，要避免使用含有酒精、香料等刺激性成分的化妆品和护肤品。同时，要避免用手触摸或搔抓治疗部位，以防止细菌感染。', 'http://localhost:8092/file/8b0e20c0-3099-424c-982e-a25de3602642.png', '2024-11-13 07:06:23', 1, NULL);
INSERT INTO `beauty_projects` VALUES (8, '唇部护理', '唇部护理能滋润保湿，淡化唇纹，丰盈双唇，提升唇部色泽，焕发健康光彩。', 120.00, '#### 工作原理\n唇部护理的主要工作原理是通过为唇部提供必要的水分和营养，增强唇部的保湿能力，同时去除唇部废旧角质，改善唇部血液循环，从而达到滋润保湿、淡化唇纹、丰盈双唇、提升唇部色泽的效果。\n\n#### 适用人群\n唇部护理适用于以下人群：\n- 唇部干燥、缺水、容易脱皮的人群。\n- 唇纹较深、唇部色泽暗淡的人群。\n- 长期使用口红、唇彩等化妆品，需要定期卸妆和保养的人群。\n唇部皮肤敏感、易受损的人群。\n\n![1aa7560496dd48fb921cb8be24d22c43.png](http://localhost:8092/file/5b8436d2-d4f6-493f-8f09-d2f4d87f9c44.png)\n\n#### 治疗过程\n唇部护理的治疗过程通常包括以下几个步骤：\n- 清洁唇部：使用温和的唇部清洁产品或清水，彻底清洁唇部，去除口红、食物残渣等污垢。\n- 去角质：使用唇部专用的去角质产品，轻柔地去除唇部废旧角质，使唇部更加光滑细腻。\n- 保湿滋润：涂抹具有保湿滋润效果的唇膏、唇膜或唇油等产品，为唇部提供必要的水分和营养，增强唇部的保湿能力。\n- 按摩唇部：轻轻按摩唇部，促进血液循环，有助于改善唇部色泽和淡化唇纹。\n- 防晒保护：在白天外出时，涂抹具有防晒效果的唇膏或唇油，避免唇部受到紫外线的伤害。\n\n#### 注意事项\n在进行唇部护理时，需要注意以下事项：\n- 选择温和的产品：选择温和无刺激的唇部护理产品，避免使用含有刺激性成分的产品，以免对唇部皮肤造成损伤。\n- 避免过度清洁：不要过度清洁唇部，以免破坏唇部皮肤的天然屏障，导致唇部更加干燥。\n- 不要撕扯死皮：避免撕扯唇部死皮，以免损伤唇部皮肤，导致唇部出血或感染。\n- 定期护理：定期进行唇部护理，保持唇部的湿润和光泽。\n- 注意饮食和生活习惯：多喝水，保持身体的水分平衡；避免长时间暴露在干燥的环境中；不要频繁舔唇或咬唇，以免加重唇部干燥。', 'http://localhost:8092/file/395ba518-5635-430a-9ae0-d682b6e26784.png', '2024-11-13 07:06:23', 1, 2);
INSERT INTO `beauty_projects` VALUES (11, '指甲护理', '指甲护理能增强甲床韧性，预防断裂，提亮色泽，使指甲更健康、光滑、亮丽。', 80.00, '#### 工作原理\n指甲护理的主要工作原理是通过为指甲提供必要的营养和滋润，增强甲床的韧性，改善指甲的质地和色泽，从而达到预防指甲断裂、使指甲更健康、光滑、亮丽的效果。指甲护理还可以有效预防指甲周围的皮肤感染和炎症，保持指甲的整体健康。\n\n#### 适用人群\n指甲护理适用于以下人群：\n- 指甲脆弱、易断裂的人群。\n- 指甲色泽暗淡、缺乏光泽的人群。\n- 指甲周围皮肤干燥、易发炎的人群。\n- 经常做美甲、需要定期护理指甲的人群。\n\n![1aa7560496dd48fb921cb8be24d22c43.png](http://localhost:8092/file/5b8436d2-d4f6-493f-8f09-d2f4d87f9c44.png)\n\n#### 治疗过程\n指甲护理的治疗过程通常包括以下几个步骤：\n- 清洁：定期清理指甲缝隙，避免细菌和污垢聚集。同时，保持指甲周围皮肤的清洁干燥。\n- 修剪：使用指甲钳或指甲刀修剪指甲，保持指甲的整洁和美观。修剪时避免将指甲剪得过短，以免导致指甲裂开或变形。\n- 营养滋润：涂抹指甲营养油或强甲油，为指甲提供必要的营养和滋润。这些产品通常含有维生素E、蛋白质等营养成分，有助于增强指甲的韧性和光泽。\n- 按摩：轻轻按摩指甲周围的皮肤，促进血液循环，有助于改善指甲的色泽和质地。\n- 保护：避免使用指甲钳挑出指甲下面的污垢，以免导致指甲松动。同时，避免长时间将指甲浸泡在水中，特别是热水，以免指甲变软和变形。\n\n#### 注意事项\n在进行指甲护理时，需要注意以下事项：\n- 选择合适的产品：选择温和无刺激的指甲护理产品，避免使用含有刺激性成分的产品，以免对指甲和周围皮肤造成损伤。\n- 避免过度修剪：不要将指甲剪得太短，以免导致指甲裂开或变形。同时，避免过度打磨指甲，以免损伤指甲表面和甲床。\n- 保持干燥：保持指甲和周围皮肤的干燥，避免长时间浸泡在水中。洗完手后应及时擦干，避免指甲和指尖潮湿。\n- 营养均衡：良好的饮食习惯对指甲也很重要。吃一些富含维生素和矿物质的食物，如蛋白质、铁、锌、钙和维生素E等，可以帮助加强指甲结构和生长。\n- 避免频繁美甲：虽然美甲可以增加指甲的美观度，但频繁美甲会对指甲造成损伤。建议减少美甲的次数，并定期进行指甲护理以恢复指甲的健康状态。', 'http://localhost:8092/file/ae168bbe-a754-41ba-abea-06b1f68d2610.png', '2024-11-13 07:06:23', 1, NULL);
INSERT INTO `beauty_projects` VALUES (12, '身体护理', '身体护理能深层滋养肌肤，保湿锁水，提升弹性，使全身肌肤柔滑细腻。', 220.00, '#### 工作原理\n身体护理的主要工作原理是通过各种护理方法（如运动、饮食、按摩、使用护肤品等）促进身体的血液循环、淋巴循环和新陈代谢，为肌肤提供必要的营养和滋润，从而增强皮肤的屏障功能，保湿锁水，提升皮肤的弹性和光泽，使全身肌肤变得柔滑细腻。\n\n#### 适用人群\n身体护理适用于以下人群：\n- 皮肤干燥、缺水、粗糙、暗沉的人群。\n- 肌肤缺乏弹性、松弛下垂的人群。\n- 希望改善身体肌肤状态、提升肌肤光泽度和细腻度的人群。\n- 长时间处于空调环境、皮肤容易干燥的人群。\n- 运动员、舞者等需要经常进行身体活动的人群，以保持皮肤状态。\n\n![1aa7560496dd48fb921cb8be24d22c43.png](http://localhost:8092/file/5b8436d2-d4f6-493f-8f09-d2f4d87f9c44.png)\n\n#### 治疗过程\n身体护理的治疗过程通常包括以下几个步骤：\n- 清洁：使用温和的清洁产品彻底清洁全身皮肤，去除污垢和油脂，为后续护理做好准备。\n- 去角质：使用身体磨砂膏或去角质产品去除身体表面的废旧角质，促进后续护肤品的吸收。\n- 滋润保湿：涂抹身体乳液、身体霜等保湿产品，为皮肤提供必要的水分和营养，增强皮肤的保湿能力。\n- 按摩：通过专业的按摩手法对身体进行按摩，促进血液循环和淋巴循环，有助于缓解肌肉疲劳、改善皮肤状态。\n- 营养补充：根据皮肤状况和需求，可以涂抹含有特定营养成分的护肤品，如维生素E、胶原蛋白等，以改善皮肤质地和光泽度。\n\n#### 注意事项\n在进行身体护理时，需要注意以下事项：\n- 选择合适的产品：选择适合自己肤质和需求的产品，避免使用含有刺激性成分的产品，以免对皮肤造成损伤。\n- 保持皮肤清洁：在进行身体护理前，要确保皮肤处于清洁状态，避免污垢和油脂影响护理效果。\n- 适度按摩：按摩时要适度用力，避免过度按摩导致皮肤受损。同时，要根据自己的身体状况和舒适度进行调整。\n- 注意保湿：保湿是身体护理的重要一环，要定期涂抹保湿产品，以保持皮肤的水分平衡。\n- 避免过度清洁：不要过度清洁皮肤，以免破坏皮肤的天然屏障功能，导致皮肤更加干燥和敏感。\n- 饮食和生活习惯：保持良好的饮食习惯和生活习惯，如多喝水、多吃富含维生素和矿物质的食物、保持充足的睡眠等，有助于改善皮肤状态和提升身体护理效果。', 'http://localhost:8092/file/fdc794e4-9b11-4b63-962d-e2dc0ac1904d.png', '2024-11-13 07:06:23', 1, NULL);
INSERT INTO `beauty_projects` VALUES (13, '热玛吉', '热玛吉可紧致肌肤，淡化皱纹，提升轮廓，焕发青春活力，安全无创，效果显著。', 1900.00, '#### 工作原理\n热玛吉的工作原理是利用高能量、高频率的E波进行单极射频传导。通过治疗探头，每秒可以发出高达600万次的振动能量波，这些能量波能够穿透皮肤表层，直达筋膜层，刺激皮肤内部的胶原蛋白收缩，并促进胶原蛋白的再生和重组。这一过程可以使松弛的皮肤变得紧致，从而达到除皱、提拉和紧致肌肤的效果。\n\n#### 适用人群\n热玛吉适用于以下人群：\n- 皮肤松弛、有细纹或皱纹的人群，尤其是面部、颈部和手部等区域。\n- 想要改善皮肤质地、提升皮肤光泽度和弹性的人群。\n- 希望通过非手术方式达到抗衰老效果的人群。\n- 对护肤品和家用抗衰仪器效果不满意，寻求更显著改善的人群。\n\n![1aa7560496dd48fb921cb8be24d22c43.png](http://localhost:8092/file/5b8436d2-d4f6-493f-8f09-d2f4d87f9c44.png)\n\n#### 治疗过程\n热玛吉的治疗过程通常包括以下几个步骤：\n- 清洁皮肤：使用专业的洁面产品彻底清洁皮肤，去除油脂和污垢。\n- 定位打格：使用热玛吉专用的定位打格纸，在患者脸上印出格子，以便全方面、均衡地定位施打。\n- 仪器调试：取出热玛吉专用治疗头，进行仪器调试，确保设备正常运行。\n- 治疗操作：医师将治疗头安装在设备上，开始进行治疗。在治疗过程中，患者会感受到一股短暂的受热感，这表示胶原蛋白已受热刺激，皮肤开始紧致。同时，需要使用热玛吉专用的耦合剂帮助射频准确施打。\n- 完成治疗：整个治疗过程通常需要1~2小时，完成后即可离开。\n\n#### 注意事项\n在进行热玛吉治疗时，需要注意以下事项：\n- 术前准备：治疗前一周内避免去角质和过度按摩皮肤。治疗当天不要化妆，保持皮肤清洁干燥。\n- 避免金属物品：术前在身上不可以佩戴任何的金属物品，如有心脏病或装有心率调整器的人群不建议进行治疗。\n- 术后护理：治疗后，皮肤可能会出现轻微的红肿和灼热感，这是正常现象。应避免用热水洗脸，保持脸部湿度，并加强防晒措施。在一周内至少敷三次面膜，以补充水分和营养。\n- 饮食调整：术后一个月内，建议合理安排饮食，避免辛辣刺激性食物，多吃富含胶原蛋白和维生素的食物，如猪蹄、鱼皮、新鲜水果和蔬菜等。\n- 避免其他美容项目：术后一个月内，不要去美容院进行按摩肌肤、护理面部等美容项目。\n- 定期复诊：为了保持治疗效果，建议定期进行复诊和巩固治疗。', 'http://localhost:8092/file/882fa2da-c69f-4096-9914-bf1afc40afac.jpg', '2024-11-13 07:06:23', 1, 2);
INSERT INTO `beauty_projects` VALUES (14, '黄金微针', '黄金微可紧致肌肤、淡化皱纹、收缩毛孔、提亮肤色，改善皮肤质地。', 200.00, '#### 工作原理\n黄金微针的工作原理是通过双极射频技术和微针技术相结合，利用矩形排列的微针刺入皮肤真皮层，释放射频能量。射频能量产生的热效应可以刺激胶原蛋白的合成和再生，同时促进胶原纤维和弹力纤维的收缩，从而改善皮肤肤质，达到抗衰老和提升面部肌肤的效果。\n\n#### 适用人群\n黄金微针主要适用于以下人群：\n- 早期衰老者：年龄在35~45岁之间，皮肤出现轻度松弛和皱纹。\n- 油性皮肤者：希望改善皮肤油脂分泌过多状况，达到控油效果。\n- 痤疮患者：需要治疗痤疮急性炎症等皮肤问题。\n- 皮肤松弛者：有改善皮肤松弛需求的人群。\n- 皮肤腺体分泌旺盛者：希望抑制部分皮肤腺体分泌的人群。\n\n![1aa7560496dd48fb921cb8be24d22c43.png](http://localhost:8092/file/5b8436d2-d4f6-493f-8f09-d2f4d87f9c44.png)\n\n#### 治疗过程\n黄金微针的治疗过程通常包括以下几个步骤：\n- 清洁面部：使用专业的洁面产品彻底清洁皮肤，去除油脂和污垢。\n- 涂抹麻药：在操作部位均匀涂抹表麻膏，并覆盖保鲜膜以防止麻药挥发。敷麻药的时间通常为30分钟。\n- 消毒清洁：清除敷的表麻膏后，用带有酒精的纱布对操作部位进行消毒和清洁。\n- 开启仪器：人体平躺于治疗床，面部朝上，准备工作完毕后，开启黄金微针射频仪器。\n- 射频操作：操作者手握治疗手柄，对治疗部位进行均匀的射频操作。\n- 术后护理：操作完毕后，给受治疗者敷上医用冷敷贴，以减轻皮肤可能出现的灼热感和红肿。冷敷时间通常为15分钟。\n\n#### 注意事项\n在进行黄金微针治疗时，需要注意以下事项：\n- 术前准备：治疗前应避免使用含有酒精或其他刺激性成分的护肤品，同时避免进行皮肤磨削等美容项目。\n- 专业评估：选择专业医疗机构和经验丰富的医生进行治疗，并在治疗前进行详细的皮肤评估。\n- 术后护理：治疗后，皮肤可能会出现轻微的红肿和灼热感，这是正常现象。应避免用热水洗脸，保持脸部湿度，并加强防晒措施。术后一周内不可吃辛辣、刺激性食物及易发食物，忌烟、忌酒，以促进皮肤恢复。\n- 避免高温环境：在治疗后一个月内，避免去高温环境，如温泉、桑拿、高温瑜伽等，并避免暴晒。\n- 定期复诊：为了保持治疗效果，建议定期进行复诊和巩固治疗。\n- 避免剧烈运动：术后要保持局部干燥整洁，不要做剧烈运动，避免出汗引起局部感染。', 'http://localhost:8092/file/3a170efa-c4ec-485e-89bc-05e560004660.jpg', '2024-11-13 07:06:23', 1, 2);
INSERT INTO `beauty_projects` VALUES (15, '眉形设计', '精致眉形，提升气质，彰显个性，自然和谐，让脸部更立体，美丽加分，自信倍增。', 300.00, '#### 工作原理\n眉形设计是根据顾客的面部骨骼、肌肉走势、五官比例、气质等因素，结合美学原理，为顾客量身定制适合的眉形。通过专业的手法和技巧，使眉毛的形状、颜色和韵味与顾客的整体形象相协调，从而达到提升面部美感的效果。\n\n#### 适用人群\n眉形设计适用于所有希望改善眉毛形状、提升面部美感的人群。特别是眉毛稀疏、眉形不佳、眉毛颜色不均或眉毛有缺陷的人群，通过眉形设计可以得到显著改善。此外，对于追求完美、希望提升个人形象气质的人群，眉形设计也是一个不错的选择。\n\n![1aa7560496dd48fb921cb8be24d22c43.png](http://localhost:8092/file/5b8436d2-d4f6-493f-8f09-d2f4d87f9c44.png)\n\n#### 治疗过程\n眉形设计的治疗过程主要包括以下几个步骤：\n- 沟通与咨询：纹绣师与顾客进行充分沟通，了解顾客的期望和需求，同时评估顾客的面部特征和气质，以确定适合的眉形。\n- 设计眉形：根据顾客的面部特征、五官比例和气质，纹绣师使用专业的眉笔或眉粉为顾客设计眉形。设计过程中，纹绣师会不断调整和优化眉形，直到达到顾客满意的效果。\n- 实施操作：设计完成后，纹绣师会使用专业的纹眉工具和技术，将眉毛部位的皮肤刺破，让颜料渗入到皮下，以形成持久的眉形。操作过程中，纹绣师会注意手法和力度的控制，以确保操作的安全和效果。\n- 术后护理：操作完成后，纹绣师会向顾客提供详细的术后护理指导，包括保持伤口清洁干燥、避免剧烈运动和接触刺激性物质等。同时，纹绣师还会定期回访顾客，了解恢复情况并提供必要的帮助。\n\n#### 注意事项\n- 选择专业机构：进行眉形设计时，应选择具有合法资质和丰富经验的专业机构，以确保操作的安全和效果。\n- 术前准备：术前应避免饮酒和服用影响凝血功能的药物，同时保持面部清洁和干燥，避免化妆和涂抹护肤品。\n- 术后护理：术后应遵循纹绣师的指导进行护理，避免剧烈运动和接触刺激性物质，以免影响恢复和效果。\n- 饮食注意：术后应避免食用辛辣、刺激性食物和海鲜等发物，以免引发过敏反应或影响恢复。\n- 定期回访：术后应定期回访纹绣师，了解恢复情况并提供必要的帮助和指导。', 'http://localhost:8092/file/b15a63b7-6053-4192-aa76-67aa6db43ad2.png', '2024-11-13 07:06:23', 1, 2);
INSERT INTO `beauty_projects` VALUES (18, '身体按摩', '身体按摩舒缓肌肉，促进血液循环，缓解疲劳，提升身体活力，促进身心健康。', 250.00, '#### 工作原理\n身体按摩的工作原理主要基于神经传导和血液循环的调节。通过对手法、力度和技巧的运用，按摩师可以对身体的各个部位进行按压、摩擦和推拿，从而刺激局部神经末梢和肌肉组织。这种刺激能够引发一系列神经传导反应，最终传递到大脑皮层，使大脑对疼痛部位产生相应的生理反应，缓解疼痛和紧张感。同时，按摩还能促进血液循环，增加受损组织的营养供应，进一步促进身体的恢复和放松。\n\n#### 适用人群\n身体按摩适用于以下人群：\n- 肌肉僵硬酸痛、扭伤、关节脱位或关节疼痛的人群。\n- 脾胃虚弱、失眠、神经衰弱、习惯性便秘等中医病症的患者。\n- 需要缓解压力、焦虑和改善睡眠质量的人群。\n- 免疫力较弱或内分泌失调的人群，希望通过按摩来增强免疫力和调节内分泌。\n\n然而，需要注意的是，有开放性创伤、急性传染病、严重心血管病或身体比较虚弱、年龄较大的患者不适合进行按摩。\n\n![1aa7560496dd48fb921cb8be24d22c43.png](http://localhost:8092/file/5b8436d2-d4f6-493f-8f09-d2f4d87f9c44.png)\n\n#### 治疗过程\n- 准备工作：将按摩区域暴露出来，换上舒适宽松的衣服或直接裸露皮肤（注意隐私保护），保证按摩环境安静、温度适宜。\n- 热身：轻轻按摩身体表面，帮助肌肉和组织放松。可以使用手掌、拳头、指尖等不同的部位进行按摩，力度适中，避免过度刺激。\n- 深层按摩：针对具体部位进行深层按摩。可以使用揉捏法、推拿法等多种手法，以圆形运动揉捏肌肉或向一个方向推动。\n- 伸展：通过拉伸肢体和关节来促进身体的柔韧性和灵活性。可以给身体某个部位施加轻微的压力并缓慢地使其弯曲和伸展。\n- 肌肉放松：在整个按摩结束时，使用轻柔的手法平抚和按摩身体表面，以帮助肌肉松弛和紧张情绪缓解。\n\n#### 注意事项\n在进行身体按摩时，需要注意以下几点：\n- 选择专业按摩师：确保按摩师具备专业的技能和资质，避免因操作不当而对身体造成伤害。\n- 避免过度按摩：按摩时间不宜过长，一个部位最长20分钟，否则可能适得其反。同时，按摩力度也要适中，避免过度用力造成损伤。\n- 注意身体状况：在饥饿状态、刚吃饱或酗酒、过度疲劳时不宜进行按摩。此外，有严重疾病或身体不适的人群应在医生指导下进行按摩。\n- 保持放松：在按摩过程中保持身心放松，不要浑身僵硬。如果感到疼痛或不适，应立即与按摩师沟通并调整手法。\n- 保暖和休息：按摩后要注意保暖，避免受风、受凉。同时，适当休息几分钟再下地活动，让身体逐渐适应。', 'http://localhost:8092/file/699e2c79-b315-49f9-a213-df3c3163f0cf.png', '2024-11-13 07:06:23', 1, NULL);
INSERT INTO `beauty_projects` VALUES (23, '牙齿美白', '牙齿美白可使牙齿更加洁白、亮丽，去除牙渍，让牙齿恢复自然亮白光泽。', 400.00, '11', 'http://localhost:8092/file/d88d6778-beec-4b18-9e98-d4dd62592e19.png', '2024-12-03 23:35:18', 1, 2);
INSERT INTO `beauty_projects` VALUES (24, 'SPA水疗', 'SPA水疗舒缓身心，促进血液循环，缓解疲劳，增强免疫力，焕发肌肤活力。', 500.00, '11', 'http://localhost:8092/file/27fbf852-3923-4ba1-9729-80d4beecfa31.png', '2024-12-03 23:37:38', 1, NULL);
INSERT INTO `beauty_projects` VALUES (25, '头发护理', '头发护理是一个细致且全面的过程，需要一系列专业的护发产品和正确的护理方法。', 200.00, '11', 'http://localhost:8092/file/32e4bff1-71bf-4c6a-ab92-efe50403feca.png', '2024-12-03 23:39:16', 1, 2);
INSERT INTO `beauty_projects` VALUES (26, '激光脱毛', '激光脱毛安全高效，长久减少毛发，肌肤光滑细腻，实现长久性脱毛。', 300.10, '11', 'http://localhost:8092/file/bffa7b97-3450-42d8-a63b-238bb7675d01.jpg', '2024-12-04 11:43:19', 1, NULL);

-- ----------------------------
-- Table structure for evaluate
-- ----------------------------
DROP TABLE IF EXISTS `evaluate`;
CREATE TABLE `evaluate`  (
  `id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '评价编号',
  `order_id` bigint(20) NULL DEFAULT NULL COMMENT '订单编号',
  `project_id` bigint(20) NULL DEFAULT NULL COMMENT '项目编号',
  `user_id` bigint(20) NULL DEFAULT NULL COMMENT '用户编号',
  `content` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL COMMENT '评价内容',
  `create_time` datetime(0) NULL DEFAULT NULL COMMENT '评价时间',
  `info` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL COMMENT '回复',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 13 CHARACTER SET = utf8 COLLATE = utf8_general_ci COMMENT = '订单评价' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of evaluate
-- ----------------------------
INSERT INTO `evaluate` VALUES (3, 2, 4, 1, '哈哈哈', '2024-11-20 11:49:23', NULL);
INSERT INTO `evaluate` VALUES (5, 3, 1, 1, '666', '2024-11-20 16:06:08', NULL);
INSERT INTO `evaluate` VALUES (8, 17, 1, 122, '很不错', '2024-12-12 22:22:29', NULL);
INSERT INTO `evaluate` VALUES (9, 18, 4, 122, '嘻嘻嘻，谢谢', '2024-12-12 22:22:44', NULL);
INSERT INTO `evaluate` VALUES (10, 22, 7, 124, '好好好哈哈哈', '2024-12-12 23:36:09', NULL);
INSERT INTO `evaluate` VALUES (11, 21, 11, 124, '不错不错，下次还来', '2024-12-12 23:36:27', NULL);
INSERT INTO `evaluate` VALUES (12, 33, 4, 1, '666', '2024-12-30 16:48:45', NULL);

-- ----------------------------
-- Table structure for items
-- ----------------------------
DROP TABLE IF EXISTS `items`;
CREATE TABLE `items`  (
  `id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '物品编号',
  `name` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL COMMENT '物品名称',
  `stock` int(11) NULL DEFAULT NULL COMMENT '当前库存',
  `img` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL COMMENT '封面图片',
  `create_time` datetime(0) NULL DEFAULT NULL COMMENT '创建时间',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 26 CHARACTER SET = utf8 COLLATE = utf8_general_ci COMMENT = '美容物品' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of items
-- ----------------------------
INSERT INTO `items` VALUES (1, '洁面乳', 82, 'http://localhost:8092/file/d0fa670a-bc1c-4e10-b83e-7023c5704a25.jpg', '2024-11-13 07:09:25');
INSERT INTO `items` VALUES (2, '眼部护理产品', 44, 'http://localhost:8092/file/beb2bdd3-b392-4f22-9e7f-579443c9c4b0.jpg', '2024-11-13 07:09:25');
INSERT INTO `items` VALUES (3, '唇部护理膏', 68, 'http://localhost:8092/file/c35f89e4-6045-4727-b451-f920fbf70076.jpg', '2024-11-13 07:09:25');
INSERT INTO `items` VALUES (4, '身体磨砂膏', 28, 'http://localhost:8092/file/5e3e81e8-350e-4bef-8390-48061acb3a88.jpg', '2024-11-13 07:09:25');
INSERT INTO `items` VALUES (5, '眉形笔', 66, 'http://localhost:8092/file/8d6c1c51-f635-451b-bca3-d6e5978a1cdc.jpg', '2024-11-13 07:09:25');
INSERT INTO `items` VALUES (6, '面膜', 37, 'http://localhost:8092/file/501fc35a-a837-441e-afac-2ae8e442b7ca.jpg', '2024-11-13 07:09:25');
INSERT INTO `items` VALUES (7, '唇部精华', 40, 'http://localhost:8092/file/4195a185-a1e3-4904-9615-545e72d52caa.png', '2024-11-13 07:09:25');
INSERT INTO `items` VALUES (8, '身体护理精华', 86, 'http://localhost:8092/file/d092ae74-f7db-44cc-a90b-7aea2cd8f164.jpg', '2024-11-13 07:09:25');
INSERT INTO `items` VALUES (9, '耦合凝胶', 118, 'http://localhost:8092/file/83026cc1-1632-4723-8134-25b808ebd557.jpg', '2024-11-13 07:09:25');
INSERT INTO `items` VALUES (10, '水光注射针头', 109, 'http://localhost:8092/file/998e480a-e5b0-4e92-aa19-84f8c61433d0.jpg', '2024-11-13 07:09:25');
INSERT INTO `items` VALUES (11, '去角质产品', 124, 'http://localhost:8092/file/24406845-2c30-4e61-b00f-0241ad874acc.jpg', '2024-11-13 07:09:25');
INSERT INTO `items` VALUES (12, '水光针注射原液', 138, 'http://localhost:8092/file/dd5d9078-ef53-4ff9-8b17-61899cf17e6f.jpg', '2024-11-13 07:09:25');
INSERT INTO `items` VALUES (13, '麻醉药品', 29, 'http://localhost:8092/file/6e493707-c93a-40a9-8b75-c8af5e09e294.jpg', '2024-11-13 07:09:25');
INSERT INTO `items` VALUES (14, '指甲护理油', 67, 'http://localhost:8092/file/b56e9d88-a542-40ae-a896-b5804f1ba39c.jpg', '2024-11-13 07:09:25');
INSERT INTO `items` VALUES (15, '一次性治疗头', 57, 'http://localhost:8092/file/cfeb27a3-ecb2-4c02-843e-5542abee4e1a.jpg', '2024-11-13 07:09:25');
INSERT INTO `items` VALUES (16, '定位打格纸', 38, 'http://localhost:8092/file/a8b82800-bb82-4f7b-b677-e0835dc09ba3.jpg', '2024-11-13 07:09:25');
INSERT INTO `items` VALUES (18, '无菌微针', 120, 'http://localhost:8092/file/24b1e840-8246-42d6-a9e7-83731601976a.jpg', '2024-11-13 07:09:25');
INSERT INTO `items` VALUES (19, '眉贴', 30, 'http://localhost:8092/file/03c4dd9c-8db3-4ad1-9c40-ab51a9a3e768.jpg', '2024-11-13 07:09:25');
INSERT INTO `items` VALUES (20, '身体按摩油', 130, 'http://localhost:8092/file/a3fc606d-3211-4001-af31-c5ac839b8a1e.jpg', '2024-11-13 07:09:25');
INSERT INTO `items` VALUES (21, '牙齿美白剂', 137, 'http://localhost:8092/file/e416613e-45f4-4f75-bbe0-085ad9744f04.jpg', '2024-11-13 07:09:25');
INSERT INTO `items` VALUES (22, '水浴精油', 20, 'http://localhost:8092/file/7217060e-a3df-4b5e-a05b-6cc1f70462a4.jpg', '2024-12-04 18:12:57');
INSERT INTO `items` VALUES (23, '发膜', 40, 'http://localhost:8092/file/2f31a58a-affe-40a4-8ced-632f747887a2.jpg', '2024-12-04 18:32:01');
INSERT INTO `items` VALUES (24, '护发精油', 30, 'http://localhost:8092/file/764bfc74-ab6b-46ba-80ed-a525f2991e1d.jpg', '2024-12-04 18:34:35');
INSERT INTO `items` VALUES (25, '美白产品', 20, 'http://localhost:8092/file/9d4f5c53-e836-4ed6-bcc2-9b66c572d574.jpg', '2024-12-04 18:35:35');

-- ----------------------------
-- Table structure for news
-- ----------------------------
DROP TABLE IF EXISTS `news`;
CREATE TABLE `news`  (
  `id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '资讯编号',
  `title` varchar(200) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL COMMENT '资讯标题',
  `cover_img` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL COMMENT '封面图片',
  `content` text CHARACTER SET utf8 COLLATE utf8_general_ci NULL COMMENT '资讯简介',
  `detail` text CHARACTER SET utf8 COLLATE utf8_general_ci NULL COMMENT '详细内容',
  `status` int(11) NULL DEFAULT NULL COMMENT '状态[0:禁用,1:启用]',
  `create_time` datetime(0) NULL DEFAULT NULL COMMENT '发布时间',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 573 CHARACTER SET = utf8 COLLATE = utf8_general_ci COMMENT = '新闻资讯' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of news
-- ----------------------------
INSERT INTO `news` VALUES (569, '光子嫩肤', 'http://localhost:8092/file/dd445466-1abf-4426-a0a1-46b3bef8c3dc.png', '采用特定的宽光谱彩光，直接照射于皮肤表面，嫩肤、去皱、去色素。', '## 基础信息\n**项目优点**\n-  副作用相对较少、恢复期也较短; \n- 针对性调节色素斑、毛孔粗大、面色晦暗、细小皱纹、肌肤粗糙、痤疮等皮肤问题，并协同作用于收缩毛孔，紧致皮肤。\n\n**项目缺点**\n- 治疗周期长，需多次治疗。\n\n**禁忌人群**\n-  妊娠期女性;\n- 光过敏者、对光敏感者及用过光敏感药物者;\n- 高血压、糖尿病患者;\n-  长期服用某些精神类药物者;\n-  服用消炎药、降压药者;\n-  两周内有日光曝晒者;7.面部有炎症者。\n\n**适用人群**\n- 适用于毛孔粗大、肤色不均、有色斑、痤疮、痘印和红血丝等皮肤问题的人群。\n\n## 使用方式\n|操作时间|恢复时间|间隔周期|\n|-|-|-|\n|10-20分钟|0-7天左右|3-6次，每次间隔1个月|\n|作用周期|操作方式|麻醉方式|\n|1-2个月|光电|无需麻醉|\n\n## 术后及常见问题\n==术前准备==\n- **护理方法：**\n治疗前一周，不能做激光、皮肤磨削术、果酸焕肤等美容项目;近期接受过暴晒者，在治疗前需向医生说明:治疗前清洁面部，不能残留化妆品。\n\n==0天~3天 红肿期==\n- **护理方法：**\n治疗后，可以使用胶原面贴敷料或冰膜;多补充维生素C，注意皮肤保湿，严格防晒，用冷水洗脸，禁烟酒及辛辣刺激的食物。\n- **恢复提示：**\n皮肤会有粗糙感，一般可在当天或隔日逐渐消失;个别患者可能会出现，短暂的红肿热等反应\n- **正常情况：** \n-泛红，结痂，变白，肤色提亮，透亮，灼热，自然，红肿，紧致，微疼，变嫩，变干\n- **异常情况：**\n过敏，水泡，疼痛难忍，流血，坑坑洼洼，色脱，蜕皮，发黑，黑色素沉着，灼伤\n\n==4~7天 结痂期==\n- **护理方法：**\n禁烟酒、辛辣刺激性食物，及颜色深的食物如:咖啡、可乐等:不参加激烈运动，避免出汗后引起感染;面部治疗后5天内，不宜用热水洗脸，擦干治疗部位后，薄薄地涂上药膏，直至痂皮脱落不可使用，其他药物或化妆品;避免日晒，尽量使用防晒或打伞，室内室外都需涂抹防晒产品，避免晒伤导致色素沉着\n- **恢复提示：**\n皮肤红肿基本消退，局部色素加深，皮肤表面出现无创性薄痂。\n- **正常情况：**\n透亮，泛红，脱落，结痂，补水，脱皮，自然，色斑，白净，细致，皮肤于燥\n- **异常情况：**\n结疤，色素沉着，过敏，水泡，疼痛难忍，流血，坑坑洼洼，色脱，蜕皮，发黑。\n\n==++8~15天 结痂脱落期++==\n- **护理方法：**\n继续使用修复产品，严格注意防晒，避免晒伤导致色素沉着:做好保湿工作，干痒严禁搔抓，要让痂皮自行成熟脱落，不得强行剥落。\n- **恢复提示：**\n痂皮逐渐脱落完毕，形成新生皮肤，呈淡粉色。\n- **正常情况：**\n结痂脱落，变白，透亮，毛孔缩小，细致，变亮，紧致，肤色提亮，红血丝，紧致。\n- **异常情况：**\n过敏，水泡，疼痛难忍，流血，坑坑洼洼，色脱，蜕皮，发黑，黑色素沉着，灼伤。\n\n==++效果显现期16天~30天++==\n- **护理方法：**\n注意防晒和保湿，如想彻底祛除斑点，可以通过疗程治疗;术后如有任何不良反应，请及时到院复诊。\n- **恢复提示：**\n术后反应消退，效果逐渐显现，肤色提亮，色斑改善。\n- **正常情况：**\n色斑脱落，掉痂，变嫩，自然，白净，变亮，紧致，肤色提亮，毛孔缩小，肤质细致。\n- **异常情况：**\n不适感，敏感，不均匀，蜕皮，过敏，水泡，疼痛难忍，流血，坑坑洼洼，色脱。\n', 1, '2024-12-05 18:29:21');
INSERT INTO `news` VALUES (570, '深圳2025年眼部下睑松弛矫正专业医院TOP3榜单揭晓！', 'http://localhost:8092/file/98a58af5-d514-47a8-955f-e4784ff3d98e.png', '深圳眼部下脸松弛矫正排名前三医院揭晓!', '深圳眼部下脸松弛矫正排名前三医院揭晓!新榜单更新，为您呈现深圳地区**的五家医院。这些医院包括深圳南山区人民医院整形美容科、深圳美菜医疗美容医院、深圳壹号美都医疗美容门诊部、深圳天丽医疗美容门诊部以及深圳鹏爱悦已医疗美容门诊部等。这份榜单是根据用户的消费行为习惯以及客户咨询反馈等多项核心数据生成的，排名不分先后。\n\n![98a58af5d51447a8955fe4784ff3d98e.png](http://localhost:8092/file/505f7a1b-d37d-463c-aa57-8eaea9130bdb.png)\n\n接下来，让我们一起详细了解这三家医院:\n一、深圳南山区人民医院整形美容科\n深圳市南山区人民医院(深圳市第六人民医院)位于深圳经济特区西部南头半岛中心区，是深圳市第四家三级甲等医院也是南山区区域医疗中心。该医院自1946年成立以来，经过多次更名和发展，现已成为一所集医疗、教学、科研、预防保健于一体的现代化医院。其整形美容科作为医院的重点科室之一，拥有先进的诊疗设备和专业的医疗团队，为患者提供意品质的医疗服务。\n\n二、深圳美莱医疗美容医院\n深圳美莱医疗美容医院位于广东省深圳市福田区深南中路，是一家专业的医疗美容机构。该医院拥有先进的医疗美容设备和专业的医疗团队，为患者提供双眼皮手术、鼻部手术、面部手术等美容服务。该医院与拥有高品质保障的国际医疗器械供应商合作，为患者提供全面、个性的奢华美容服务。该医院引进世界各地的整形美容医生，以精湛的技术和自然和谐的审美理念，为求美者带来与众不同的美丽与自信。\n\n三、深圳壹号美都医疗美容门诊部\n深圳天丽医疗美容门诊部是深圳地区一家历史悠久，规模宏大的专业医疗美容机构。中深圳中韩天丽医疗投资管理有限公司投资，总投资额达5000万元人民币，占地面积超过8000平米，堪称深圳的一颗璀璨明珠。作为深圳较早的超五星级整形美容医院，它得到了国家卫生行政部门的严格核准，集教学、科研与临床于一体。早在2010年，它就被评为中国十大具影响力整形机构之一，深受消费者信赖。\n此门诊部拥有宽敞舒适的就诊环境，独立的私密咨询室，并且配备了国际标准的层流净化手术室8间。院内设有多个中心包括整形美容中心、非手术整形美容中心、激光美容中心等，为患者提供全方位的美容服务。\n一、二楼的整形美容中心是深圳与韩国合作的专科机构，拥有技艺高超的中外整形外科专家。这里配备了先进的手术显微镜和共振溶脂系统，开展各种整形美容项目，满足患者的需求。无论是韩式眼部整形、微创无痕隆胸，还是个性化隆鼻\n三点弧线改脸形，都能在这里得到完美的实现。\n三楼激光美容中心引进了国际先进的激光治疗设备，为患者提供高品质的激光美容服务。口腔美容中心也聘请了国内高等口腔教授级专家，为您的口腔健康保驾护航。\n四楼的医疗SPA会所是深圳唯一一家结合手术整形术后保养的场所。这里结合了中国千年的中医学术研究出的美容方式实现了补水、抗衰、祛痘、祛斑、美白等功效。患者可以在这里享受特调的花茶、养颜的甜品，还可以在瑜伽和健身房中放松身心，营造一个轻松舒适的休闲环境。\n\n深圳鹏爱悦己医疗美容门诊部\n深圳鹏爱悦已医疗美容门诊部位于深圳市罗湖区人民南路3023号中旅大厦1-3楼。这是一家提供全方位医疗美容服务的现代化机构，包括双眼皮手术、鼻部手术、面部手术等。这里汇聚了一批经验丰富的医疗美容专家，致力于为患者带来专业的美容服务。\n深圳天丽医疗美容门诊部整形美容价格明细表\n以下是天丽医疗美容门诊部的部分整形美容项目价格\n假体隆胸内窥镜超声刀:1438~4340元\n抽脂肪丰胸:1452~3640元\n复合do胸:1230~4925元\n..以及其他项目\n\n深圳出名整形美容医生介绍\n郭能强医师:擅长丰胸微创手术、鼻孔内切开矫正术等，现任协和医院整形外科副教授，经验丰富。\n梁智医师:擅长隆乳美胸术、假体隆鼻等，作为烧伤整形科主任，他在整形美容领域有着深厚的造诣。这两位医生都在整形美容领域有着卓越的成就和丰富的经验，是患者值得信赖的专家。深圳天丽医疗美容门诊部以其专业、安全、高效的服务，赢得了广大患者的认可和好评，是您实现美丽的佳选择', 1, '2024-12-09 12:49:08');
INSERT INTO `news` VALUES (571, '深圳市上眼睑下垂矫正医院排行合集参考，美莱医院备受好评！', 'http://localhost:8092/file/8c03542a-f28b-471f-91d0-351e2a7992e8.png', '深圳市上眼睑下垂矫正医院排行合集参考，美莱医院备受好评！', '   很多人都不知道大小眼在医学上称为上睑下垂，目前上睑下垂分三个程度：轻度、中度、重度。轻度的上睑下垂一般只会影响形象，中度、重度上睑下垂不仅仅会影响个人形象还会影响视力。所以有大小的朋友一定要重视起来，建议尽早到院做上睑下垂矫正治疗。想做上睑下垂矫正治疗的你是不是不知道医院怎么选择？下文会为大家推荐靠谱整形医院一起去看看！\n\n![07fadbb0ec6f327feb7bdba9a2948de.png](http://localhost:8092/file/e3feb925-cf37-4f00-88aa-1554a00423b9.png)\n\n   深圳美莱医疗美容医院做上睑下垂矫正手术效果不错，深圳美莱于2012年登记成立，开业至今一直拥有良好的口碑。医院设有整形科室开展眼部整形、鼻部整形、隆胸手术、吸脂塑形等整形项目，可以为广大爱美者提供变美服务。深圳美莱医院详细地址：深圳市福田区深南中路2044号，有需要的爱美者可以到院先面诊。\n\n　　在深圳美莱医院做上睑下垂矫正治疗前，美莱整形医生会先面诊求美者，需要根据其眼部形态实际情况设计矫正方案，并安排求美者进行体检预约手术时间。美莱会提供标准手术室进行上睑下垂矫正手术，整个手术过程由经验丰富医护团队根据设计好的矫正方案进行手术，所以术后达到的上睑下垂矫正效果理想。\n\n![961d0f116c83e184451a9509bbf6fc2.png](http://localhost:8092/file/3d135098-8173-4204-9c9e-3e3561442566.png)\n\n做完上睑下垂矫正手术后一般多久可以消肿？\n\n　　在正规医院做了上睑下垂矫正手术后，一般需要3到4周左右眼部才能消肿，具体消肿司机还要以实际恢复情况为准。\n\n　　做了上睑下垂矫正手术后消肿时间是由局部损伤的轻重程度决定，出现了轻微的损伤3三周左右的时间会慢慢好转，损伤比较严重的情况下可能会需要4周左右。如果术后没有做好护理工作发生了炎症，那么就需要更长的时间才能消肿了。因此需要特别注意眼部的护理。在恢复期间尽量不要熬夜，同时还要避免用眼过度。', 1, '2024-12-12 22:40:26');
INSERT INTO `news` VALUES (572, 'OPT美肤', 'http://localhost:8092/file/a11905ec-5838-426a-8b11-d9b880126b62.png', '解决肌肤的多种瑕疵问题，肌肤变得更加的白嫩细滑，有光泽。', '## 基础信息\n**项目优点**\n- 1.效果较明显，疗效更高; \n- 2.可同时治疗色斑、痘痘、痘印、肤色暗沉、皮肤粗糙、毛孔粗大、红血丝等多种问题; \n- 3.所需恢复相对较短。\n\n**项目缺点**\n- 1.价格相对较高。\n- 2.操作不当有烫伤的可能性\n\n**禁忌人群**\n- 1.妊娠期女性;\n- 2.光过敏者、对光敏感者及用过光敏感药物者;\n- 3.高血压、糖尿病患者;\n- 4长期服用某些精神类药物者;\n- 5.服用消炎药、降压药者;\n- 6.2周内有日光曝晒者;面部有炎症者，两周内有日光曝晒者;\n- 7.面部有炎症者。\n\n**适用人群**\n- 1.改善皮肤质地、皱纹、毛孔粗大、色泽晦暗、痘痘、皮肤松弛等。\n- 2,良性的色素性皮肤疾病:崔斑、老年斑、崔斑样痣、咖啡斑、色素异常症、色素沉着、黄福斑、色素斑等。\n- 3.良性的皮肤血管疾病:鲜红斑痣、血管瘤、面部或躯干的毛细血管扩张(红血丝)，酒糟皇、玫瑰座疮、如蛛、Civate皮肤导色症、腹部静脉和静脉畸形等。\n- 4疤痕类病变:痤疮疤痕:外科疤。\n- 5.皮肤纹理:妊娠纹;膨胀纹;萎缩纹;肥胖纹。\n- 6.全身脱毛。\n\n## 使用方式\n|操作时间|恢复时间|间隔周期|\n|-|-|-|\n|10-20分钟|0-7天左右|3-6次，每次间隔1个月|\n|作用周期|操作方式|麻醉方式|\n|1-2个月|光电|无需麻醉|\n\n## 术后及常见问题\n==术前准备==\n- **护理方法：**\n使用外用维A酸药膏或者祛斑产品的人，建议停药1周后开始治疗。\n治疗前2周内不能做激光、磨皮、果酸换肤等美容项目。疗前一个月内避免强烈日晒或做室外SPA。发炎、伤口化脓的皮肤不适合治疗。\n口服维A酸的人，建议停药3个月后再开始治疗。如果有光敏感病史、皮肤病变、免疫系统异常，需要做好跟医生的沟通。\n\n==0天~3天 红肿期==\n- **护理方法：**\n治疗后当天，宜用低温水清洁皮肤，可使用保湿防晒护肤品;治疗后要避免，阳光紫外线直接照射，需要加强防晒，避免晒伤导致色素沉着;禁烟酒及辛辣刺激的食物。\n- **恢复提示：**\n治疗后会出现，短暂的红肿热等反应。\n\n==组织恢复期4天~7天==\n- **护理方法：**\n治疗后一星期内，不能使用含果酸、A酸、水杨酸、去角质、高浓度维他命C、酒精等，刺激性成分的保养品。\n- **恢复提示：**\n红肿反应等基本消退，皮肤恢复正常状态。\n\n==++8天~30天效果显现期++==\n- **护理方法：**\n可以继续完成疗程的治疗，并做好补水防晒的工作，避免晒伤导致色素沉着。\n- **恢复提示：**\n可见效果，慢慢起效，根据个人体质和情况不同，一般3-6次就会有效果。\n', 1, '2024-12-12 23:24:22');

-- ----------------------------
-- Table structure for orders
-- ----------------------------
DROP TABLE IF EXISTS `orders`;
CREATE TABLE `orders`  (
  `id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '订单编号',
  `user_id` bigint(20) NULL DEFAULT NULL COMMENT '用户编号',
  `project_id` bigint(20) NULL DEFAULT NULL COMMENT '项目编号',
  `order_no` varchar(200) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL COMMENT '订单号',
  `beautician_id` bigint(20) NULL DEFAULT NULL COMMENT '美容师编号',
  `money` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL COMMENT '价格',
  `status` int(11) NULL DEFAULT NULL COMMENT '状态[0:待支付,1:已支付,2:待服务,3:服务中,4:已完成,5:已取消]',
  `create_time` datetime(0) NULL DEFAULT NULL COMMENT '创建时间',
  `end_time` datetime(0) NULL DEFAULT NULL COMMENT '完成时间',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 34 CHARACTER SET = utf8 COLLATE = utf8_general_ci COMMENT = '美容订单' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of orders
-- ----------------------------
INSERT INTO `orders` VALUES (2, 1, 4, '1732011827630', 2, '150', 6, '2024-11-19 18:23:48', '2024-11-20 11:50:40');
INSERT INTO `orders` VALUES (3, 1, 1, '1732067058437', 2, '859.00', 6, '2024-11-20 09:44:18', '2024-11-20 11:50:40');
INSERT INTO `orders` VALUES (8, 1, 1, '1732094684722', 2, '859.00', 4, '2024-11-20 17:24:45', '2024-12-02 18:25:09');
INSERT INTO `orders` VALUES (9, 1, 1, '1732094684723', 1, '859', 6, '2024-11-22 11:28:05', '2024-11-22 11:28:08');
INSERT INTO `orders` VALUES (17, 122, 1, '1733410993467', 1, '859.00', 6, '2024-12-05 23:03:13', '2024-12-05 23:58:09');
INSERT INTO `orders` VALUES (18, 122, 4, '1733411351774', 2, '150.00', 6, '2024-12-05 23:09:12', '2024-12-05 23:10:43');
INSERT INTO `orders` VALUES (19, 122, 5, '1733414233427', 1, '500.00', 4, '2024-12-05 23:57:13', '2024-12-05 23:58:10');
INSERT INTO `orders` VALUES (20, 124, 23, '1734017146245', 3, '400.00', 4, '2024-12-12 23:25:46', '2024-12-12 23:28:14');
INSERT INTO `orders` VALUES (21, 124, 11, '1734017340427', 2, '80.00', 6, '2024-12-12 23:29:00', '2024-12-12 23:29:33');
INSERT INTO `orders` VALUES (22, 124, 7, '1734017615020', 5, '180.00', 6, '2024-12-12 23:33:35', '2024-12-12 23:35:02');
INSERT INTO `orders` VALUES (23, 124, 13, '1734017846672', 8, '1900.00', 4, '2024-12-12 23:37:27', '2024-12-12 23:37:57');
INSERT INTO `orders` VALUES (24, 122, 1, '1734052778867', 2, '859.00', 6, '2024-12-13 09:19:39', '2024-12-13 09:20:20');
INSERT INTO `orders` VALUES (25, 122, 12, '1734158929425', 1, '220.00', 4, '2024-12-14 14:48:49', '2024-12-15 12:20:08');
INSERT INTO `orders` VALUES (26, 122, 12, '1734159298398', 1, '220.00', 4, '2024-12-14 14:54:58', '2024-12-15 12:20:09');
INSERT INTO `orders` VALUES (27, 122, 4, '1734159338752', 1, '150.00', 4, '2024-12-14 14:55:39', '2024-12-15 12:29:38');
INSERT INTO `orders` VALUES (28, 122, 4, '1734159388647', 1, '150.00', 4, '2024-12-14 14:56:29', '2024-12-15 12:33:26');
INSERT INTO `orders` VALUES (29, 122, 4, '1734159455116', 1, '150.00', 4, '2024-12-14 14:57:35', '2024-12-15 12:33:30');
INSERT INTO `orders` VALUES (30, 123, 1, '1734159511476', 1, '859.00', 5, '2024-12-14 14:58:31', NULL);
INSERT INTO `orders` VALUES (31, 123, 11, '1734237151474', 1, '80.00', 2, '2024-12-15 12:32:31', NULL);
INSERT INTO `orders` VALUES (32, 123, 8, '1734257697474', 1, NULL, 0, '2024-12-15 18:14:57', NULL);
INSERT INTO `orders` VALUES (33, 1, 4, '1735548480505', 1, '150.00', 6, '2024-12-30 16:48:01', '2024-12-30 16:48:30');

-- ----------------------------
-- Table structure for project_item
-- ----------------------------
DROP TABLE IF EXISTS `project_item`;
CREATE TABLE `project_item`  (
  `id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '编号',
  `project_id` bigint(20) NULL DEFAULT NULL COMMENT '项目编号',
  `item_id` bigint(20) NULL DEFAULT NULL COMMENT '物品编号',
  `num` int(11) NULL DEFAULT NULL COMMENT '所需数量',
  `create_time` datetime(0) NULL DEFAULT NULL COMMENT '创建时间',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 30 CHARACTER SET = utf8 COLLATE = utf8_general_ci COMMENT = '美容项目消耗物品' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of project_item
-- ----------------------------
INSERT INTO `project_item` VALUES (1, 1, 9, 1, '2024-11-13 16:00:37');
INSERT INTO `project_item` VALUES (2, 1, 6, 2, '2024-11-13 16:00:41');
INSERT INTO `project_item` VALUES (9, 4, 1, 1, '2024-12-04 18:37:51');
INSERT INTO `project_item` VALUES (10, 4, 11, 1, '2024-12-04 18:38:09');
INSERT INTO `project_item` VALUES (11, 4, 2, 1, '2024-12-04 18:38:25');
INSERT INTO `project_item` VALUES (12, 5, 10, 1, '2024-12-04 18:38:41');
INSERT INTO `project_item` VALUES (13, 5, 12, 2, '2024-12-04 18:38:55');
INSERT INTO `project_item` VALUES (14, 5, 6, 2, '2024-12-04 18:39:15');
INSERT INTO `project_item` VALUES (15, 7, 13, 1, '2024-12-04 18:39:56');
INSERT INTO `project_item` VALUES (16, 7, 6, 2, '2024-12-04 18:40:09');
INSERT INTO `project_item` VALUES (17, 8, 11, 1, '2024-12-04 18:40:28');
INSERT INTO `project_item` VALUES (18, 8, 7, 2, '2024-12-04 18:40:48');
INSERT INTO `project_item` VALUES (19, 8, 3, 1, '2024-12-04 18:40:57');
INSERT INTO `project_item` VALUES (20, 11, 14, 3, '2024-12-04 18:41:37');
INSERT INTO `project_item` VALUES (21, 12, 4, 1, '2024-12-04 18:42:05');
INSERT INTO `project_item` VALUES (22, 12, 8, 2, '2024-12-04 18:42:25');
INSERT INTO `project_item` VALUES (23, 13, 15, 2, '2024-12-04 18:43:13');
INSERT INTO `project_item` VALUES (24, 13, 16, 2, '2024-12-04 18:43:31');
INSERT INTO `project_item` VALUES (25, 14, 18, 4, '2024-12-04 18:43:54');
INSERT INTO `project_item` VALUES (26, 14, 9, 1, '2024-12-04 18:44:09');
INSERT INTO `project_item` VALUES (27, 15, 5, 1, '2024-12-04 18:44:19');
INSERT INTO `project_item` VALUES (28, 18, 20, 1, '2024-12-04 18:44:40');
INSERT INTO `project_item` VALUES (29, 23, 21, 3, '2024-12-12 23:27:36');

-- ----------------------------
-- Table structure for subscribes
-- ----------------------------
DROP TABLE IF EXISTS `subscribes`;
CREATE TABLE `subscribes`  (
  `id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '预约编号',
  `project_id` bigint(20) NULL DEFAULT NULL COMMENT '项目编号',
  `user_id` bigint(20) NULL DEFAULT NULL COMMENT '用户编号',
  `start_time` datetime(0) NULL DEFAULT NULL COMMENT '预约时间',
  `create_time` datetime(0) NULL DEFAULT NULL COMMENT '创建时间',
  `status` int(11) NULL DEFAULT NULL COMMENT '状态[0:预约成功,1:已完成,2:已取消,3:待支付]',
  `order_id` bigint(20) NULL DEFAULT NULL COMMENT '订单ID',
  `bid` bigint(20) NULL DEFAULT NULL COMMENT '美容师',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 34 CHARACTER SET = utf8 COLLATE = utf8_general_ci COMMENT = '项目预约' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of subscribes
-- ----------------------------
INSERT INTO `subscribes` VALUES (2, 1, 1, '2024-11-19 00:00:00', '2024-11-18 16:46:36', 1, 3, 2);
INSERT INTO `subscribes` VALUES (3, 4, 1, '2024-11-20 15:00:00', '2024-11-18 17:06:36', 1, 2, 2);
INSERT INTO `subscribes` VALUES (5, 1, 92, '2024-11-21 13:00:00', '2024-11-20 16:15:04', 1, 7, NULL);
INSERT INTO `subscribes` VALUES (6, 1, 1, '2024-11-27 02:00:00', '2024-11-20 17:23:54', 1, 8, 2);
INSERT INTO `subscribes` VALUES (7, 1, 92, '2024-12-02 00:00:00', '2024-12-02 18:04:09', 1, 11, NULL);
INSERT INTO `subscribes` VALUES (8, 1, 92, '2024-12-05 00:00:00', '2024-12-02 18:05:30', 1, 10, NULL);
INSERT INTO `subscribes` VALUES (9, 6, 92, '2024-12-02 00:00:00', '2024-12-02 18:12:46', 1, 12, NULL);
INSERT INTO `subscribes` VALUES (11, 7, 92, '2024-12-02 00:18:00', '2024-12-02 18:36:32', 1, 13, NULL);
INSERT INTO `subscribes` VALUES (12, 1, 92, '2024-12-02 19:00:00', '2024-12-02 18:43:54', 1, 14, NULL);
INSERT INTO `subscribes` VALUES (13, 1, 92, '2024-12-02 00:00:00', '2024-12-02 18:47:45', 1, 15, NULL);
INSERT INTO `subscribes` VALUES (14, 4, 92, '2024-12-03 15:52:12', '2024-12-03 15:52:14', 1, 16, NULL);
INSERT INTO `subscribes` VALUES (15, 1, 122, '2024-12-05 23:02:00', '2024-12-05 23:02:02', 1, 17, NULL);
INSERT INTO `subscribes` VALUES (16, 4, 122, '2024-12-05 23:09:00', '2024-12-05 23:09:01', 1, 18, NULL);
INSERT INTO `subscribes` VALUES (17, 5, 122, '2024-12-05 23:55:36', '2024-12-05 23:55:37', 1, 19, NULL);
INSERT INTO `subscribes` VALUES (18, 23, 124, '2024-12-12 23:25:34', '2024-12-12 23:25:36', 1, 20, NULL);
INSERT INTO `subscribes` VALUES (19, 11, 124, '2024-12-12 23:28:42', '2024-12-12 23:28:43', 1, 21, NULL);
INSERT INTO `subscribes` VALUES (20, 7, 124, '2024-12-12 23:33:18', '2024-12-12 23:33:21', 1, 22, NULL);
INSERT INTO `subscribes` VALUES (21, 13, 124, '2024-12-12 23:36:56', '2024-12-12 23:36:57', 1, 23, NULL);
INSERT INTO `subscribes` VALUES (22, 1, 122, '2024-12-13 09:19:21', '2024-12-13 09:19:23', 1, 24, NULL);
INSERT INTO `subscribes` VALUES (23, 12, 122, '2024-12-14 13:55:39', '2024-12-14 13:55:41', 1, 25, NULL);
INSERT INTO `subscribes` VALUES (24, 12, 122, '2024-12-14 14:48:34', '2024-12-14 14:48:35', 1, 26, NULL);
INSERT INTO `subscribes` VALUES (25, 4, 122, '2024-12-14 14:55:27', '2024-12-14 14:55:28', 1, 27, NULL);
INSERT INTO `subscribes` VALUES (26, 4, 122, '2024-12-14 14:56:09', '2024-12-14 14:56:10', 1, 28, NULL);
INSERT INTO `subscribes` VALUES (27, 4, 122, '2024-12-14 15:00:00', '2024-12-14 14:57:25', 1, 29, NULL);
INSERT INTO `subscribes` VALUES (28, 1, 123, '2024-12-14 15:00:00', '2024-12-14 14:58:23', 1, 30, NULL);
INSERT INTO `subscribes` VALUES (29, 8, 123, '2024-12-14 15:06:37', '2024-12-14 15:06:39', 3, 32, NULL);
INSERT INTO `subscribes` VALUES (30, 11, 123, '2024-12-15 12:30:46', '2024-12-15 12:30:48', 1, 31, NULL);
INSERT INTO `subscribes` VALUES (31, 13, 122, '2024-12-17 00:00:00', '2024-12-17 19:50:07', 0, NULL, NULL);
INSERT INTO `subscribes` VALUES (32, 4, 1, '2024-12-31 00:00:00', '2024-12-30 16:34:57', 0, NULL, 3);
INSERT INTO `subscribes` VALUES (33, 4, 1, '2024-12-31 00:00:00', '2024-12-30 16:47:35', 1, 33, 1);

-- ----------------------------
-- Table structure for user
-- ----------------------------
DROP TABLE IF EXISTS `user`;
CREATE TABLE `user`  (
  `id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '编号',
  `username` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL COMMENT '用户名',
  `password` varchar(200) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL COMMENT '密码',
  `nick_name` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL COMMENT '昵称',
  `avatar` varchar(200) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL COMMENT '头像',
  `age` int(11) NULL DEFAULT NULL COMMENT '年龄',
  `sex` int(11) NULL DEFAULT NULL COMMENT '性别[0:女,1:男]',
  `tel` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL COMMENT '手机号',
  `info` text CHARACTER SET utf8 COLLATE utf8_general_ci NULL COMMENT '简介',
  `create_time` datetime(0) NULL DEFAULT NULL COMMENT '创建时间',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 133 CHARACTER SET = utf8 COLLATE = utf8_general_ci COMMENT = '用户' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of user
-- ----------------------------
INSERT INTO `user` VALUES (1, 'xiaolan', '123456', '小蓝', 'http://localhost:8092/file/62fc1e8c-9fb9-422e-929a-6de8965c8fa3.jpg', 12, 1, '17670748521', '靓仔一枚，喜欢蓝天~', '2024-11-14 17:52:09');
INSERT INTO `user` VALUES (122, 'user1', '123456', '小张', 'http://localhost:8092/file/d9187eed-5eba-4ad7-8889-a232076c62ef.jpg', 20, 0, '13611112222', '美食家，喜欢尝试各种美食。', '2024-12-04 12:17:42');
INSERT INTO `user` VALUES (123, 'user2', '123456', '小黄', 'http://localhost:8092/file/b801190e-f869-431f-a69d-a0bacbddd9ac.jpg', 30, 0, '13611110001', '喜欢旅游，尤其是自然风光。', '2024-12-04 12:18:56');
INSERT INTO `user` VALUES (124, 'user3', '123456', '小美', 'http://localhost:8092/file/bb6f8b3d-2f59-4c6d-9ccd-50d99172f444.jpg', 22, 0, '13611110002', '画家，喜欢绘画和创作。', '2024-12-04 12:21:03');
INSERT INTO `user` VALUES (125, 'user5', '123456', '小梁', 'http://localhost:8092/file/0261b70b-1372-41c5-8028-0c1e4da298d2.jpg', 40, 1, '13611110003', '厨师，喜欢烹饪美食。', '2024-12-04 12:32:59');
INSERT INTO `user` VALUES (126, 'user6', '123456', '小石', 'http://localhost:8092/file/de3ffbea-28d8-4c64-90b4-691a28d85281.jpg', 18, 0, '13611110001', '音乐家，喜欢演奏乐器。', '2024-12-04 12:33:57');
INSERT INTO `user` VALUES (127, 'user7', '123456', '小陆', 'http://localhost:8092/file/3cb384af-ddc2-4d85-842a-2dfd1b27a691.jpg', 50, 0, '13611110002', '演员，喜欢表演和舞台表演。', '2024-12-04 12:35:00');
INSERT INTO `user` VALUES (128, 'user8', '123456', '小华', 'http://localhost:8092/file/6ce45aea-6385-4116-8a80-1c2d2936e184.jpg', 55, 1, '13611112222', '艺术家，喜欢创作艺术作品。', '2024-12-04 12:39:52');
INSERT INTO `user` VALUES (129, 'user9', '123456', '小邓', 'http://localhost:8092/file/ca637cee-5f71-4e64-91e0-afde582a7e35.jpg', 33, 1, '13611113333', '环保主义者，喜欢参与环保活动。', '2024-12-04 12:40:56');
INSERT INTO `user` VALUES (130, 'user10', '123456', '小苏', 'http://localhost:8092/file/fa1b7173-f823-4905-bd5c-3aff95b524f6.jpg', 60, 0, '13644445555', '电影爱好者，喜欢看各种类型的电影。', '2024-12-04 12:42:03');
INSERT INTO `user` VALUES (131, 'user11', '123456', '小覃', 'http://localhost:8092/file/2246d3be-01f8-4853-b8f0-6aa505893079.jpg', 25, 0, '13677778888', '音乐制作人，喜欢创作自己的音乐。', '2024-12-04 13:17:10');
INSERT INTO `user` VALUES (132, '181059', '123456', '一点点', 'http://localhost:8092/file/5252b999-167a-4862-bf69-1520f088e1a7.jpg', 5, 0, '12345678763', '嘻嘻嘻', '2024-12-17 23:00:26');

SET FOREIGN_KEY_CHECKS = 1;
